app/Http/Controllers/Frontend/UserController.php

   public function getMarketList() {
      $market_sector =DB::table("market_sector")->where(['status'=>1,'is_deleted'=>0])->get();
      $cData = [];
      $AllMarkets = [];
      foreach($market_sector as $market) {

        $count = DB::table("startup_category_subcategory_mapping")->where([
          'status'=>1,
          'categoryid'=>1,
          'subcategoryid'=>$market->id
        ])->count();
---
select * from `market_sector` where (`status` = '1' and `is_deleted` = '0')
select count(*) as aggregate from `startup_category_subcategory_mapping` where (`status` = '1' and `categoryid` = '1' and `subcategoryid` = '1')

   public function getTechologyList() {

      $technology =DB::table("technology")->where(['status'=>1,'is_deleted'=>0])->get();
      $cData = [];
      $AllTech = [];
      foreach($technology as $tech) {
        $count = DB::table("startup_category_subcategory_mapping")->where([
          'status'=>1,
          'categoryid'=>2,
          'subcategoryid'=>$tech->id
        ])->count();
---
select * from `technology` where (`status` = '1' and `is_deleted` = '0')
select count(*) as aggregate from `startup_category_subcategory_mapping` where (`status` = '1' and `categoryid` = '2' and `subcategoryid` = '1')

   public function getBussinessGoalsList() {

      $startup_business_goal =DB::table("startup_business_goal")->where(['is_deleted'=>0])->get();
      $cData = [];
      $AllGoals = [];
      foreach($startup_business_goal as $bGoal) {
        $count = DB::table("startup_category_subcategory_mapping")->where([
          'status'=>1,
          'categoryid'=>3,
          'subcategoryid'=>$bGoal->id
        ])->count();
---
select * from `startup_business_goal` where (`is_deleted` = '0')
select count(*) as aggregate from `startup_category_subcategory_mapping` where (`status` = '1' and `categoryid` = '3' and `subcategoryid` = '1')

   public function startupfilter($a,$b,$c,$d) {

      $col = 'company_name';
      $order = 'desc';
      if(in_array($d, [0,1])) {
        $order = 'asc';
      }

      DB::enableQueryLog();
      if((($a[0] == 0) && (sizeof($a) == 1)) && (($b[0] == 0) && (sizeof($b) == 1)) && (($c[0] == 0) && (sizeof($c) == 1))) {
        $companies = DB::table('startup_companyinfo')->select('startup_companyinfo.id','startup_companyinfo.company_name','startup_companyinfo.company_website','startup_companyinfo.location','startup_companyinfo.number_of_employees','startup_companyinfo.markets','startup_companyinfo.technology','startup_companyinfo.business_goal','startup_companyinfo.round_type','startup_companyinfo.amount','startup_companyinfo.closing_date','startup_companyinfo.deck_url','startup_companyinfo.high_concept_pitch','startup_companyinfo.product','startup_companyinfo.logo','startup_companyinfo.investing','startup_companyinfo.meeting_investors','startup_companyinfo.country','startup_companyinfo.mobile','startup_companyinfo.created_by','startup_companyinfo.created_at','startup_companyinfo.updated_at','startup_companyinfo.status','startup_companyinfo.user_id','startup_companyinfo.is_deleted')
        ->join('startup_category_subcategory_mapping', 'startup_companyinfo.id', '=', 'startup_category_subcategory_mapping.companyid')
        ->where('startup_category_subcategory_mapping.status', 1)
        ->groupBy('companyid')
        ->orderBy($col,$order)
        ->paginate(2);
      } else {
        $companies = DB::table('startup_companyinfo')->select('startup_companyinfo.id','startup_companyinfo.company_name','startup_companyinfo.company_website','startup_companyinfo.location','startup_companyinfo.number_of_employees','startup_companyinfo.markets','startup_companyinfo.technology','startup_companyinfo.business_goal','startup_companyinfo.round_type','startup_companyinfo.amount','startup_companyinfo.closing_date','startup_companyinfo.deck_url','startup_companyinfo.high_concept_pitch','startup_companyinfo.product','startup_companyinfo.logo','startup_companyinfo.investing','startup_companyinfo.meeting_investors','startup_companyinfo.country','startup_companyinfo.mobile','startup_companyinfo.created_by','startup_companyinfo.created_at','startup_companyinfo.updated_at','startup_companyinfo.status','startup_companyinfo.user_id','startup_companyinfo.is_deleted')
        ->join('startup_category_subcategory_mapping', 'startup_companyinfo.id', '=', 'startup_category_subcategory_mapping.companyid')
        ->where('startup_category_subcategory_mapping.status', 1)
        ->where('startup_category_subcategory_mapping.categoryid', 1)
        ->whereIn('startup_category_subcategory_mapping.subcategoryid', explode(",",$a))
        ->orWhere('startup_category_subcategory_mapping.categoryid', 2)
        ->WhereIn('startup_category_subcategory_mapping.subcategoryid', explode(",",$b))
        ->orWhere('startup_category_subcategory_mapping.categoryid', 3)
        ->WhereIn('startup_category_subcategory_mapping.subcategoryid', explode(",",$c))
        ->groupBy('companyid')
        ->orderBy($col,$order)
        ->paginate(2);
---
select count(*) as aggregate from `startup_companyinfo` inner join `startup_category_subcategory_mapping` on `startup_companyinfo`.`id` = `startup_category_subcategory_mapping`.`companyid` where `startup_category_subcategory_mapping`.`status` = '1' and `startup_category_subcategory_mapping`.`categoryid` = '1' and `startup_category_subcategory_mapping`.`subcategoryid` in ('0', '8') or `startup_category_subcategory_mapping`.`categoryid` = '2' and `startup_category_subcategory_mapping`.`subcategoryid` in ('0', '2') or `startup_category_subcategory_mapping`.`categoryid` = '3' and `startup_category_subcategory_mapping`.`subcategoryid` in ('0') group by `companyid`

        $c['user_id'] = $company->user_id;


        $round_type =DB::table("round_type")->where(['id'=>$company->round_type])->get();
---
select * from `round_type` where (`id` is null)

   public function startup(){



      $companies = DB::table('startup_companyinfo')->paginate(2);
---
select * from `startup_companyinfo` limit 2 offset 0
select count(*) as aggregate from `startup_companyinfo`

        $c['user_id'] = $company->user_id;


        $round_type =DB::table("round_type")->where(['id'=>$company->round_type])->get();
---
select * from `round_type` where (`id` = '6')